/*编写一条正则，用来验证此规则：一个6~16位的字符串，必须同时包含大小写字母和数字  */
let reg = /(?!^[a-zA-Z]+$)(?!^[0-9]+$)(?!^[a-z0-9]+$)(?!^[A-Z0-9]+$)^[a-zA-Z0-9]{6,16}$/;
// ?! 负向预查
//(?!^[a-zA-Z]+$) 不能是纯大小写字母   (?!^[0-9]+$)不能是纯数字
//(?!^[a-z0-9]+$)(?!^[A-Z0-9]+$) 不能是小写字母和数字 /不能是大写字母和数字
//所有只能数字、字母大小写都需要有 ^[a-zA-Z0-9]{6~16}
console.log(reg.test('anAB09kks9J')); //true

/* 1-10位：数字、字母、下划线组成的字符串，必须有_ */
// let reg = /(?!^[a-zA-Z0-9])^\w{1,10}$/;

/* 字符串中包含\w,但是必须包含_ */
let reg = /(?=_)\w+/;
console.log(reg.test('21sw_'));  //true
